# shared - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.kafka_serverless_cluster.upstash_kafka_cluster.default: Refreshing state... [id=upstash-cluster-a4b3191f-b87d-43af-aba0-4a81effdcc3c]
module.common_resources.module.cockroachdb_serverless_cluster.cockroach_cluster.default: Refreshing state... [id=817df27a-5ac7-4775-94e2-cf6c12b3ad3c]
module.common_resources.module.simple_email_service.aws_ses_domain_identity.default: Refreshing state... [id=mail.connectilly.com]
module.common_resources.module.kafka_serverless_cluster.aws_ssm_parameter.default: Refreshing state... [id=production_kafka-cluster-id]
module.common_resources.module.simple_email_service.aws_ses_domain_dkim.default: Refreshing state... [id=mail.connectilly.com]
module.common_resources.module.cognito_user_pool.aws_cognito_user_pool.default: Refreshing state... [id=us-east-1_2YKqaqdTD]
module.common_resources.module.cockroachdb_serverless_cluster.aws_ssm_parameter.default: Refreshing state... [id=production_cockroachdb-serverless-cluster-id]
module.common_resources.module.cognito_user_pool.aws_cognito_user_pool_domain.default: Refreshing state... [id=connectilly]
module.common_resources.module.cognito_user_pool.aws_ssm_parameter.default: Refreshing state... [id=production_user-pool-id]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.common_resources.module.gcp_project.aws_ssm_parameter.default will be created
  + resource "aws_ssm_parameter" "default" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "production_gcp-project-id"
      + tags           = {
          + "environment"   = "production"
          + "resource"      = "shared"
          + "resource_type" = "gcp-project"
        }
      + tags_all       = {
          + "environment"   = "production"
          + "resource"      = "shared"
          + "resource_type" = "gcp-project"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.common_resources.module.gcp_project.google_project.default will be created
  + resource "google_project" "default" {
      + auto_create_network = true
      + id                  = (known after apply)
      + name                = "production"
      + number              = (known after apply)
      + org_id              = "140072916350"
      + project_id          = "production-connectilly"
      + skip_delete         = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*